DLC1p1/background/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


motionSolverLibs 
(
  "libfvMotionSolvers.so"
  "sixDoFRigidBodyMotion.so"
);
dynamicFvMesh       dynamicOversetFvMesh;

solver          sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{

    patches         (floatingObject);
    innerDistance   100.0;
    outerDistance   101.0;

    centreOfMass    (135 125 -14.1);

    
    mass            2.0093E+7 ;

    // Cuboid moment of inertia about the centre of mass
    momentOfInertia (1.251E+10 1.251E+10 2.367E+10);
    report          on;
    accelerationRelaxation 0.6;
    accelerationDamping    1.0;

    solver
    {
        type Newmark;
    }

    constraints
    {

        /*
        fixedPoint
        {
             sixDoFRigidBodyMotionConstraint point;
             centreOfRotation (0.5 0.45 0.1);
        }
        */

        fixedLine
        {
            sixDoFRigidBodyMotionConstraint line;
            //centreOfRotation (0.5 0.45 0.1);
            direction (0 0 1);
        }

        /*
        fixedAxis
        {
            sixDoFRigidBodyMotionConstraint axis;
            axis (0 1 0);
        }
        */
    }
    restraints
    {
    
      //turbineLoadFF // Restraint name , must be unique
      //{
      //  sixDoFRigidBodyMotionRestraint turbineAL; // Restraint type
      //}
      /*
      umbilical
      {
      		sixDoFRigidBodyMotionRestraint linearSpring;
      		anchor		(0 0 -200 ) ;
      		refAttachmentPt	(0 0 0 ) ;
      		stiffness		6.22e4 ;
      		damping		0 ;
      		restLength		200 ;
      	}*/
      		
      		
      
      /*moorDynR2
	{
		sixDoFRigidBodyMotionRestraint moorDynR2;
		inputFile                      "Mooring/lines_v2.txt";
		writeMooringVTK                false;
	}*/

      

    }
}

// ************************************************************************* //
