DLC1p1/background/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    oversetPatch
    {
        type            overset;
    }
    
    "(outlet|stationaryWalls|atmosphere)"
    {
        type            zeroGradient;
    }

    inlet
    {
        type    zeroGradient;
    }
    outlet
    {
        type    fixedValue;
        value   $internalField;
    }

    floatingObject
    {
        type            fixedFluxPressure;
    }

    overset
    {
        patchType       overset;
        type            zeroGradient;
    }
}

// ************************************************************************* //
