DLC1p1/background/system/topoSetDictFinestSmallWave
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../myVars" //Include global variables
actions
(
    
    /*{
        name    overSetFinestSmall;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
     	 box (#eval "$plat_offset_X-0.4*$D" #eval "$plat_offset_Y-0.4*$D" -70) (#eval "$plat_offset_X+0.4*$D" #eval "$plat_offset_Y+0.4*$D" 60);
   	}
    }*/
    {
        name    waterLineFinestSmall;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
     	 box ($xmin  #eval "$ymin" #eval "-1.5*$wave_height") ($xmax  #eval "$ymax" #eval "1.5*$wave_height");
   	}
    }
    
    
    
    
    
    {
   	 // Mandatory (inherited) entries
    	name        combinedFinestSmall;
    	type        cellZoneSet;
    	action      new;

    	// Mandatory entries
    	source      setToCellZone;
    	set         waterLineFinestSmall;
    }  
     /*{
   	 // Mandatory (inherited) entries
    	name        combinedFinestSmall;
    	type        cellZoneSet;
    	action      add;

    	// Mandatory entries
    	source      setToCellZone;
    	set         overSetFinestSmall;
    }  */

   

    
);


// ************************************************************************* //
